app/controllers/categories_controller.rb

  def index
    respond_with(@categories = Category.by_name.all)
---
SELECT * FROM "categories"

  def show
    respond_with(@category = Category.find(params[:id]))
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)

  def edit
    respond_with(@category = Category.find(params[:id]))
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)

  def update
    @category = Category.find(params[:id])
    flash[:notice] = "Successfully updated category." if @category.update_attributes(params[:category])
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
UPDATE "categories" SET "name" = 'Молоко и молочные продукты', "updated_at" = '2010-01-30 17:59:12' WHERE "id" = 1