app/controllers/products_controller.rb

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "products" WHERE ("products".category_id = 1)
---
  def index

    #if params[:search]
      #params[:search] = params[:search].force_encoding('utf-8')
      #params[:search] = params[:search]
    #end

    options = default_options

    if params[:category_id]
      @categories = [Category.find(params[:category_id])]
      options[:conditions] = "category_id = #{params[:category_id].to_i}"
    else
      @categories = Category.search_by_product_name(params[:search])
    end

    if params[:search]
      add_and_to_conditions(options)
      options[:conditions] << "name LIKE '%#{params[:search]}%'"
    end

    @products = Product.paginate(options)

SELECT * FROM "categories"
---
  def new
    @product = product_with_defaults
    @categories = Category.all(:order => "name ASC")

INSERT INTO "products" ("name", "updated_at", "calnutrition_value", "created_at") VALUES('Banana', '2010-01-29 16:44:51', 123.0, '2010-01-29 16:44:51')
---
  def create
    #params[:product][:name] = params[:product][:name].force_encoding('UTF-8')

    @product = Product.new(params[:product])
    if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 1)
SELECT * FROM "categories"
---
  def edit
    @product = Product.find(params[:id])
    @categories = Category.all(:order => "name ASC")

SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "calnutrition_value" = 123.12, "updated_at" = '2010-01-29 16:47:22' WHERE "id" = 1
---
  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(params[:product])

SELECT * FROM "categories"
SELECT "products".id FROM "products" WHERE ("products"."name" = 'Брынза из коровьего молока' AND "products".id <> 1) LIMIT 1
---
  def find_category_by_name(category_name)
    category = Category.search_by_name(category_name).first
      if category
        @categories = [category]
        @products = category.products.paginate(default_options)