app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    flash[:notice] = t(:success_reg) if @user.save
---
INSERT INTO "users" ("last_login_at", "updated_at", "crypted_password", "single_access_token", "perishable_token", "username", "password_salt", "current_login_at", "failed_login_count", "persistence_token", "login_count", "email", "created_at") VALUES(NULL, '2010-01-31 14:34:43', '3b77acd88efbeaba9459cdff0425886c723cd670a782cfd9e886d0f49fa0b8fdd4e3686d5092201e9d3c477d8d108f88b39cabfdae046a7fd30b33bffeeebf54', 'uusT-8mjA0Ic0RJ9cD31', 'DNSMMZiD-nn1Ea3Hb6gh', 'victor', '4B3jnMmUHrv10jZrOPVM', NULL, '0', '096fa341b8531a37d30c0ff8745166a8de398085f9934824cef7aaf9e2e13114b7fec43210825a29487e176646b34362ffbce6b3c6b83d021abda4437bd64e50', '0', 'xuily@yandex.ru', '2010-01-31 14:34:43')

  def update
    @user = current_user
    flash[:notice] = t(:success_profile_update) if @user.update_attributes(params[:user])
---
UPDATE "users" SET "born" = '1981-07-08', "perishable_token" = 'aoLQkQBJO6e3bNnvzMMg', "female" = 'f', "updated_at" = '2010-02-01 10:14:23' WHERE "id" = 1